---
kind: method
id: M:Autodesk.Revit.DB.GroupLoadOptions.GetDuplicateTypeNamesHandler
source: html/632172cb-da11-ab42-2b48-7d91fb783d10.htm
---
# Autodesk.Revit.DB.GroupLoadOptions.GetDuplicateTypeNamesHandler Method

Returns current duplicate type names handler or Nothing nullptr a null reference ( Nothing in Visual Basic) if none is set.

## Syntax (C#)
```csharp
public IDuplicateTypeNamesHandler GetDuplicateTypeNamesHandler()
```